{"posts":[{"title":"About Me","text":"Yuan Gao“Build Somethings Abstract” Research StatementI am passionate about exploring the intersection of ubiquitous computing, mobile systems, human-computer interaction (HCI), and security privacy. My research aims to develop innovative solutions that seamlessly integrate advanced computing technologies into everyday life, ensuring that these systems are not only efficient and user-friendly but also secure and privacy-respecting. By bridging the gap between these fields, I hope to contribute to the creation of a more connected and secure digital environment, where technology enhances the human experience without compromising personal privacy or security. Through this interdisciplinary approach, I strive to advance the frontiers of knowledge and foster a safer, more intuitive interaction between humans and technology. EducationUniversity of Wisconsin - Madison, Madison, USA &lt;img src=&quot;/image/wisclogo.png&quot; alt=&quot;&quot; width=&quot;50&quot; height=&quot;50&quot;&gt;Bachelor of Science in Computer SciencesCumulative GPA: 4.00/4.00 September 2023 — Present ExperienceUniversity of Utah Software Security Group, Salt Lake City, USAResearch AssistantFebruary 2024 — PresentAdvised by Professor Jun XuResearch Area:** Focused on System and Software Security, specializing in Reverse Engineering, Fuzzing, Program Analysis, and enhancing ML privacy to address software vulnerabilities. -Project: Validating Correctness of Decompilation with Wild Binaries -Skills: Reverse Engineering, Fuzzing Test, Program Analysis ProjectsFUSE-based Wisc Filesystem, Madison, USAApril 2024 Developed a block-based filesystem in C using FUSE, implementing a traditional filesystem structure with a superblock, inode and data block bitmaps, and inodes and data blocks. Implemented core operations: create, read, write, and manage directories, ensuring efficient data handling and integrity. Utilized mmap for efficient disk image manipulation, allowing seamless memory mapping and file operations. Designed and implemented methods including wfs_getattr, wfs_mknod, wfs_mkdir, wfs_unlink, wfs_rmdir, wfs_read, wfs_write, and wfs_readdir to handle various filesystem operations. Handled complex challenges like maintaining consistency of inodes and data blocks, ensuring efficient space allocation, and managing file and directory metadata. Dynamic Resource Optimization for Deep Learning Systems, In Progress Developing and optimizing DL model variants using PyTorch and Torch-Pruning to effectively prune ResNet and VGG architectures, aimed at reducing computational overhead and enhancing model efficiency. Implementing a reinforcement learning-based task scheduler to dynamically prioritize tasks, improving resource allocation and minimizing deadline misses in a real-time execution environment. Utilizing multi-objective evolutionary algorithms (MOEA) to optimize model scaling and execution strategies, balancing between real-time constraints and model accuracy. Contributing to the continuous evaluation of model performance and scheduling effectiveness, refining strategies to maximize throughput under varying system conditions. Managing and storing multiple scaled model variants in a structured directory system to facilitate efficient testing and deployment.","link":"/2024/07/25/About-Me/"}],"tags":[],"categories":[],"pages":[{"title":"About Me","text":"Yuan GaoEducation University of Wisconsin - Madison, Madison, USABachelor of Science in Computer SciencesCumulative GPA: 4.00/4.00**September 2023 — Present Teaching Assistant: CSLC CS Tutor Coursework: Operating System, High-Performance Computing, OOP and Data Structure (Java and Python), System Programming (C), Artificial Intelligence Awards: Dean’s List, National Cyber League Fall 2022 Team Game Top 4 ExperienceUniversity of Utah Software Security Group, Salt Lake City, USAResearch AssistantFebruary 2024 — PresentAdvised by Professor Jun XuResearch Area:** Focused on System and Software Security, specializing in Reverse Engineering, Fuzzing, Program Analysis, and enhancing ML privacy to address software vulnerabilities. Project: Validating Correctness of Decompilation with Wild Binaries Skills: Reverse Engineering, Fuzzing Test, Program Analysis ProjectsFUSE-based Wisc Filesystem, Madison, USAApril 2024 Developed a block-based filesystem in C using FUSE, implementing a traditional filesystem structure with a superblock, inode and data block bitmaps, and inodes and data blocks. Implemented core operations: create, read, write, and manage directories, ensuring efficient data handling and integrity. Utilized mmap for efficient disk image manipulation, allowing seamless memory mapping and file operations. Designed and implemented methods including wfs_getattr, wfs_mknod, wfs_mkdir, wfs_unlink, wfs_rmdir, wfs_read, wfs_write, and wfs_readdir to handle various filesystem operations. Handled complex challenges like maintaining consistency of inodes and data blocks, ensuring efficient space allocation, and managing file and directory metadata. Dynamic Resource Optimization for Deep Learning Systems, In Progress Developing and optimizing DL model variants using PyTorch and Torch-Pruning to effectively prune ResNet and VGG architectures, aimed at reducing computational overhead and enhancing model efficiency. Implementing a reinforcement learning-based task scheduler to dynamically prioritize tasks, improving resource allocation and minimizing deadline misses in a real-time execution environment. Utilizing multi-objective evolutionary algorithms (MOEA) to optimize model scaling and execution strategies, balancing between real-time constraints and model accuracy. Contributing to the continuous evaluation of model performance and scheduling effectiveness, refining strategies to maximize throughput under varying system conditions. Managing and storing multiple scaled model variants in a structured directory system to facilitate efficient testing and deployment. Research StatementContent for the research statement can be added here.","link":"/about/index.html"}]}